package com.github.djaler.markovchain

/**
 * @author Kirill Romanov
 */
fun main(args: Array<String>) {
    val sentences = textToSentences(
        """
Я не люблю фатального исхода,
От жизни никогда не устаю.
Я не люблю любое время года,
В которое болею или пью.
Я не люблю холодного цинизма,
В восторженность не верю, и ещё -
Когда чужой мои читает письма,
Заглядывая мне через плечо.

Я не люблю, когда наполовину
Или когда прервали разговор.
Я не люблю, когда стреляют в спину,
Я также против выстрелов в упор.
Я ненавижу сплетни в виде версий,
Червей сомненья, почестей иглу.
Или когда всё время против шерсти,
Или когда железом по стеклу.

Я не люблю уверенности сытой,
Уж лучше пусть откажут тормоза.
Досадно мне, коль слово "честь" забыто
И коль в чести наветы за глаза.
Когда я вижу сломанные крылья,
Нет жалости во мне, и неспроста, -
Я не люблю насилья и бессилья,
Вот только жаль распятого Христа.

Я не люблю себя, когда я трушу,
Досадно мне, когда невинных бьют.
Я не люблю, когда мне лезут в душу,
Тем более, когда в неё плюют.
Я не люблю манежи и арены,
На них мильон меняют по рублю,
Пусть впереди большие перемены,
Я это никогда не полюблю."""
    )

    val markov = Markov()
    markov.fillFromText(sentences)

    println(markov.generateSentence())
}
